/* глобальный набор карточек */
window.loadoutData = {
  columns: ["Младший", "Средний", "Старший", "Сосед", "Пёс соседа", "Всё могу (x2)"],
  rows:    ["100", "125", "150", "175", "200"],

  /* сами картинки */
  cells: Array.from({ length: 5 }, (_, row) =>
    Array.from({ length: 6 }, (_, col) => ({
      image: `/Loadouts/Базовый-Калибры/${col + 1}-${row + 1}.png`
    }))
  ),

  /* Индексация с 1-1 (Ряд-стобец)*/
  // ПОМЕНЯТЬ МЕСТАМИ РЯДЫ И СТОЛБЦЫ
  marked: [
    [2, 1],
    [3, 1],
    [1, 3],
    [2, 2],
    [3, 3],
    [4, 2],
    [5, 2],
    [4, 3],
    [5, 3],
    [1, 5],
    [2, 5],
    [3, 5],
    [4, 5],
    [5, 5],
  ]
};
